"Cleanup completed" = "Limpieza completada";
"%d selected, free up %@ disk space" = "%d seleccionados, liberar %@ de espacio en disco";
"%ld items in total, %@ selected" = "Total de %ld elementos, %@ seleccionados";
"%ld similar photos, occupying %@" = "%ld fotos similares, ocupando %@";
"Archive" = "Archivo";
"Are you sure you want to clean the selected files?" = "¿Estás seguro de que deseas limpiar los archivos seleccionados?";
"Cancel" = "Cancelar";
"Clean up all selected files" = "Limpiar todos los archivos seleccionados";
"Clean up all the selected files after backing up" = "Limpiar todos los archivos seleccionados después de la copia de seguridad";
"Cleaning up %@" = "Limpiando %@";
"Close" = "Cerrar";
"Comparing the similar images..." = "Comparando las imágenes similares...";
"Created date" = "Fecha de creación";
"Earlier" = "Anterior";
"Exporting files..." = "Exportando archivos...";
"Last Month" = "El mes pasado";
"Last Week" = "La semana pasada";
"No matching files were found." = "No se encontraron archivos coincidentes.";
"No similar pictures found!" = "¡No se encontraron imágenes similares!";
"Ok" = "Aceptar";
"Open Finder" = "Abrir el explorador";
"Organizing remaining files..." = "Organizando los archivos restantes...";
"Permissions denied, creation failed!" = "Permisos denegados, falló la creación.";
"Please select a folder or file." = "Por favor, selecciona una carpeta o archivo.";
"Please select the file to export." = "Por favor, selecciona el archivo a exportar.";
"Reset" = "Restablecer";
"Search for files...." = "Buscar archivos....";
"Select the files to clean up." = "Selecciona los archivos a limpiar.";
"The selected files will be packed and cleaned up." = "Los archivos seleccionados se empaquetarán y limpiarán.";
"This Year" = "Este año";
"Today" = "Hoy";
"Files cannot be cleaned up without deletion permission." = "Los archivos no se pueden limpiar sin permiso de eliminación.";
"Yesterday" = "Ayer";
"Clean up the selected files" = "Limpiar los archivos seleccionados";

